In [1]:
# Importing pandas and numpy libraries
import pandas as pd
import numpy as np

# Defining lists
row1 = list([1001.0, 'Pandas Banking', 235000, 248000, 5.5, 2013,3,10, 0])
row2 = list([1002.0, 'Pandas Grocery', 196000, 205000, 4.5, 2016,4,30, 0])
row3 = list([1003.0, 'Pandas Telecom', 167000, 193000, 15.5, 2010,11,24, 0])
row4 = list([1004.0, 'Pandas Transport', 79000, 90000, 13.9, 2018,1,15, 1])
row5 = list([1005.0, 'Pandas Insurance', 241000, 264000, 9.5, 2009,6,1, 0])

# Defining a DataFrame
data_frame = pd.DataFrame(data=[row1, row2, row3, row4, row5])

# Display DataFrame values
data_frame

        0                 1       2       3     4     5   6   7  8
0  1001.0    Pandas Banking  235000  248000   5.5  2013   3  10  0
1  1002.0    Pandas Grocery  196000  205000   4.5  2016   4  30  0
2  1003.0    Pandas Telecom  167000  193000  15.5  2010  11  24  0
3  1004.0  Pandas Transport   79000   90000  13.9  2018   1  15  1
4  1005.0  Pandas Insurance  241000  264000   9.5  2009   6   1  0

In [2]:
# Display DataFrame info
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       5 non-null      float64
 1   1       5 non-null      object
 2   2       5 non-null      int64
 3   3       5 non-null      int64
 4   4       5 non-null      float64
 5   5       5 non-null      int64
 6   6       5 non-null      int64
 7   7       5 non-null      int64
 8   8       5 non-null      int64
dtypes: float64(2), int64(6), object(1)
memory usage: 488.0+ bytes

In [3]:
# Convert column 0 into a int
data_frame[0] = data_frame[0].astype('int')
data_frame[0]

0    1001
1    1002
2    1003
3    1004
4    1005
Name: 0, dtype: int64

In [4]:
# Summing column 2 and column 3 together
data_frame[2] + data_frame[3]

0    483000
1    401000
2    360000
3    169000
4    505000
dtype: int64

In [5]:
# Create list of column headers
column_names = ["Customer ID", "Customer Name", "2018 Revenue", "2019 Revenue", "Growth", "Start Year", "Start Month", "Start Day", "New Customer"]
column_names

['Customer ID',
 'Customer Name',
 '2018 Revenue',
 '2019 Revenue',
 'Growth',
 'Start Year',
 'Start Month',
 'Start Day',
 'New Customer']

In [6]:
# Replace missing column headers
data_frame.columns = column_names
data_frame

,Customer ID,Customer Name,2018 Revenue,2019 Revenue,Growth,Start Year,Start Month,Start Day,New Customer
0,1001,Pandas Banking,235000,248000,5.5,2013,3,10,0
1,1002,Pandas Grocery,196000,205000,4.5,2016,4,30,0
2,1003,Pandas Telecom,167000,193000,15.5,2010,11,24,0
3,1004,Pandas Transport,79000,90000,13.9,2018,1,15,1
4,1005,Pandas Insurance,241000,264000,9.5,2009,6,1,0

In [11]:
#Define the csv URL
file_url = 'https://raw.githubusercontent.com/PacktWorkshops/The-Pandas-Workshop/master/Chapter06/Data/retail_purchase_missing_headers.csv'

# Import the csv as a DataFrame
data_frame = pd.read_csv(file_url)

#Display the DataFrame
data_frame

    10001  24/05/20        Wheat  4.8lb  €17       Fline Store
0   10002  05/05/20  Fruit Juice  3.1lb  €19  Dello Superstore
1   10003  27/04/20   Vegetables  1.2lb  €15     Javies Retail
2   10004  05/05/20          Oil  3.1lb  €17     Javies Retail
3   10005  27/04/20        Wheat  4.8lb  €13     Javies Retail
4   10006  14/01/20       Butter  3.6lb  €27   Oldi Superstore
5   10007  20/04/20          Oil  4.8lb  €21  Dello Superstore
6   10008  05/05/20        Wheat  3.6lb  €25   Oldi Superstore
7   10009  17/04/20       Fruits  1.2lb  €24   Oldi Superstore
8   10010  15/06/20          Oil  4.4lb  €25       Kanes Store
9   10011  17/06/20          Oil  4.4lb  €16       Fline Store
10  10012  11/06/20       Cheese  2.3lb  €20       Fline Store
11  10013  19/03/20         Rice  4.4lb  €27       Kanes Store
12  10014  01/01/20       Cheese  1.2lb  €10       Fline Store
13  10015  07/07/20  Fruit Juice  3.6lb  €27   Oldi Superstore

In [12]:
# Import the csv as a DataFrame
data_frame = pd.read_csv(file_url, header=None)

#Display the DataFrame
data_frame

        0         1            2      3    4                 5
0   10001  24/05/20        Wheat  4.8lb  €17       Fline Store
1   10002  05/05/20  Fruit Juice  3.1lb  €19  Dello Superstore
2   10003  27/04/20   Vegetables  1.2lb  €15     Javies Retail
3   10004  05/05/20          Oil  3.1lb  €17     Javies Retail
4   10005  27/04/20        Wheat  4.8lb  €13     Javies Retail
5   10006  14/01/20       Butter  3.6lb  €27   Oldi Superstore
6   10007  20/04/20          Oil  4.8lb  €21  Dello Superstore
7   10008  05/05/20        Wheat  3.6lb  €25   Oldi Superstore
8   10009  17/04/20       Fruits  1.2lb  €24   Oldi Superstore
9   10010  15/06/20          Oil  4.4lb  €25       Kanes Store
10  10011  17/06/20          Oil  4.4lb  €16       Fline Store
11  10012  11/06/20       Cheese  2.3lb  €20       Fline Store
12  10013  19/03/20         Rice  4.4lb  €27       Kanes Store
13  10014  01/01/20       Cheese  1.2lb  €10       Fline Store
14  10015  07/07/20  Fruit Juice  3.6lb  €27   Oldi Superstore

In [13]:
# Create list of column headers
column_names = ["Receipt Id", "Date of Purchase", "Product Name", "Product Weight", "Total Price", "Retail shop name"]

# Replace missing column headers
data_frame.columns = column_names
data_frame

,Receipt Id,Date of Purchase,Product Name,Product Weight,Total Price,Retail shop name
0,10001,24/05/20,Wheat,4.8lb,€17,Fline Store
1,10002,05/05/20,Fruit Juice,3.1lb,€19,Dello Superstore
2,10003,27/04/20,Vegetables,1.2lb,€15,Javies Retail
3,10004,05/05/20,Oil,3.1lb,€17,Javies Retail
4,10005,27/04/20,Wheat,4.8lb,€13,Javies Retail
5,10006,14/01/20,Butter,3.6lb,€27,Oldi Superstore
6,10007,20/04/20,Oil,4.8lb,€21,Dello Superstore
7,10008,05/05/20,Wheat,3.6lb,€25,Oldi Superstore
8,10009,17/04/20,Fruits,1.2lb,€24,Oldi Superstore
9,10010,15/06/20,Oil,4.4lb,€25,Kanes Store
10,10011,17/06/20,Oil,4.4lb,€16,Fline Store
11,10012,11/06/20,Cheese,2.3lb,€20,Fline Store
12,10013,19/03/20,Rice,4.4lb,€27,Kanes Store
13,10014,01/01/20,Cheese,1.2lb,€10,Fline Store
14,10015,07/07/20,Fruit Juice,3.6lb,€27,Oldi Superstore

In [14]:
!pip install mimesis

Collecting mimesis
  Downloading mimesis-4.1.2.tar.gz (2.8 MB)
     |████████████████████████████████| 2.8 MB 1.8 MB/s eta 0:00:01
Building wheels for collected packages: mimesis
  Building wheel for mimesis (setup.py) ... done
  Created wheel for mimesis: filename=mimesis-4.1.2-py3-none-any.whl size=2848668 sha256=dfd96406e4d1c2645a8a791098fcf60602f6eb2193c7b87ca2f7280fa63b183d
  Stored in directory: /Users/williamso/Library/Caches/pip/wheels/5a/04/57/acd217c68a0f4a5c19e2851b1bf20af424a202f374f6477b7f
Successfully built mimesis
Installing collected packages: mimesis
Successfully installed mimesis-4.1.2

In [40]:
from mimesis import Person
from mimesis import Address
from mimesis.enums import Gender
from mimesis import Datetime
person = Person('en')
import pandas as pd
import random
person = Person()
addess = Address()
datetime = Datetime()
def create_rows_mimesis(num=1):
    output = [{"full_name":person.full_name(),
                   "address":addess.address() + ', '+ addess.city() + ', '+ addess.state(),
                   #"name":person.name() + ' ' + person.name(),
                   #"email":person.email(),
                   "creation_date_time":datetime.datetime()
                   #"paragraph":person.paragraph(),
                   #"Conrad":person.catch_phrase(),
                   #"randomdata":random.randint(1000,2000)
              } for x in range(num)
             ]
    return output

df_mimesis = pd.DataFrame(create_rows_mimesis(10))

In [41]:
df_mimesis

,full_name,address,creation_date_time
0,Regena Phillips,"1252 Ord Townline, Pampa, New Hampshire",2018-02-08 22:32:23.172602
1,Rolande Bowen,"1091 Santa Barbara Line, Fullerton, Georgia",2015-05-29 23:01:58.196541
2,Josiah Spencer,"1268 Burgoyne Promenade, San Leandro, Florida",2013-08-23 09:41:48.824323
3,Latoyia Watts,"352 Dearborn Gate, Norman, New York",2004-05-29 02:07:28.531585
4,Maddie Blair,"1110 London Line, Flagstaff, North Dakota",2020-05-18 15:23:12.243274
5,Pasquale Cooper,"1313 Silverview Stravenue, Kenner, North Carolina",2006-04-12 11:47:38.053828
6,Giuseppe Wood,"738 Opalo Circle, Brooklyn Center, Kansas",2001-03-20 17:14:45.150522
7,Lindsey Garza,"747 Desmond Nene, Olive Branch, Wisconsin",2008-04-24 19:42:11.206692
8,Randy Mcpherson,"171 Byron Street, Pleasanton, Vermont",2010-06-21 22:52:23.019956
9,Cristobal Walsh,"55 Crestwell Square, Oxford, Alaska",2014-12-13 09:47:34.974209

In [42]:
df_mimesis.to_csv(r'dataframe.csv', index = False, header=True)

In [ ]:
file_url = 'https://raw.githubusercontent.com/PacktWorkshops/The-Pandas-Workshop/master/Chapter06/Data/retail_purchase_missing_headers.csv'
data_frame = pd.read_csv(file_url)
data_frame

In [28]:
# Defining columns
column_names = ["Customer ID", None, "2018 Revenue", "2019 Revenue", "Growth", "Start Year", "Start Month", "Start Day", "New Customer"]

# Defining lists
row1 = list([1001.0, 'Pandas Banking', '235000', '248000', '5.5', 2013,3,10, 0])
row2 = list([1002.0, 'Pandas Grocery', '196000', '205000', '4.5', 2016,4,30, 0])
row3 = list([1003.0, 'Pandas Telecom', '167000', '193000', '15.5', 2010,11,24, 0])
row4 = list([1004.0, 'Pandas Transport', '79000', '90000', '13.9', 2018,1,15, 1])
row5 = list([1005.0, 'Pandas Insurance', '241000', '264000', '9.5', 2009,6,1, 0])

# Defining a DataFrame
data_frame = pd.DataFrame(data=[row1, row2, row3, row4, row5], columns=column_names)

# Display DataFrame values
data_frame

,Customer ID,NaN,2018 Revenue,2019 Revenue,Growth,Start Year,Start Month,Start Day,New Customer
0,1001.0,Pandas Banking,235000,248000,5.5,2013,3,10,0
1,1002.0,Pandas Grocery,196000,205000,4.5,2016,4,30,0
2,1003.0,Pandas Telecom,167000,193000,15.5,2010,11,24,0
3,1004.0,Pandas Transport,79000,90000,13.9,2018,1,15,1
4,1005.0,Pandas Insurance,241000,264000,9.5,2009,6,1,0

In [10]:
# Create function to remove '%'
def remove_percentage(column):
    new_column = column.replace('%', '')
    return float(new_column)

# Convert "Growth" into a float
data_frame['Growth'] = data_frame['Growth'].apply(remove_percentage)
data_frame["Growth"]

0     5.5
1     4.5
2    15.5
3    13.9
4     9.5
Name: Growth, dtype: float64

In [11]:
# Rename the columns
data_frame.rename(columns={'Start Year': 'year', 'Start Month': 'month', 'Start Day': 'day'}, inplace=True)

# Convert the 3 columns into a datetime:
data_frame['Starting Date'] = pd.to_datetime(data_frame[['day', 'month', 'year']])
data_frame['Starting Date']

0   2013-03-10
1   2016-04-30
2   2010-11-24
3   2018-01-15
4   2009-06-01
Name: Starting Date, dtype: datetime64[ns]

In [12]:
# Convert "New Customer" into a bool
data_frame["New Customer"] = data_frame['New Customer'].astype('bool')
data_frame["New Customer"]

0    False
1    False
2    False
3     True
4    False
Name: New Customer, dtype: bool

In [13]:
# Convert "Customer Name" into a category
data_frame["Customer Name"] = data_frame['Customer Name'].astype('category')
data_frame["Customer Name"]

0      Pandas Banking
1      Pandas Grocery
2      Pandas Telecom
3    Pandas Transport
4    Pandas Insurance
Name: Customer Name, dtype: category
Categories (5, object): [Pandas Banking, Pandas Grocery, Pandas Insurance, Pandas Telecom, Pandas Transport]

In [14]:
# Display DataFrame dtypes
data_frame.dtypes

Customer ID               int64
Customer Name          category
2018 Revenue              int64
2019 Revenue              int64
Growth                  float64
year                      int64
month                     int64
day                       int64
New Customer               bool
Starting Date    datetime64[ns]
dtype: object

In [15]:
# Adding revenue together
data_frame['2018 Revenue'] + data_frame['2019 Revenue']

0    483000
1    401000
2    360000
3    169000
4    505000
dtype: int64

In [16]:
# Difference between 'Starting Date' and '2020-09-01'
data_frame['Starting Date'] - pd.to_datetime('2020-09-01')

0   -2732 days
1   -1585 days
2   -3569 days
3    -960 days
4   -4110 days
Name: Starting Date, dtype: timedelta64[ns]

In [17]:
# Remove 'year','month','day'
data_frame.drop(['year','month','day'], axis = 1, inplace=True)

# Add null values
data_frame.iloc[0,0] = None
data_frame.iloc[4,1] = None
data_frame.iloc[2,2] = None
data_frame.iloc[3,3] = None
data_frame.iloc[3,4] = None
data_frame.iloc[1,5] = None
data_frame.iloc[2,6] = None

# Display the Dataframe
data_frame

,Customer ID,Customer Name,2018 Revenue,2019 Revenue,Growth,New Customer,Starting Date
0,NaN,Pandas Banking,235000.0,248000.0,5.5,0.0,2013-03-10
1,1002.0,Pandas Grocery,196000.0,205000.0,4.5,NaN,2016-04-30
2,1003.0,Pandas Telecom,NaN,193000.0,15.5,0.0,NaT
3,1004.0,Pandas Transport,79000.0,NaN,NaN,1.0,2018-01-15
4,1005.0,NaN,241000.0,264000.0,9.5,0.0,2009-06-01

In [18]:
# Display DataFrame info
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer ID    4 non-null      float64
 1   Customer Name  4 non-null      category
 2   2018 Revenue   4 non-null      float64
 3   2019 Revenue   4 non-null      float64
 4   Growth         4 non-null      float64
 5   New Customer   4 non-null      float64
 6   Starting Date  4 non-null      datetime64[ns]
dtypes: category(1), datetime64[ns](1), float64(5)
memory usage: 573.0 bytes

In [19]:
# Convert "Customer ID" into a int
data_frame["Customer ID"] = data_frame['Customer ID'].astype('int')
data_frame["Customer ID"]

ValueError: Cannot convert non-finite values (NA or inf) to integer

In [20]:
# Convert "Customer Name" into a object
data_frame["Customer Name"] = data_frame['Customer Name'].astype('object')
data_frame["Customer Name"]

0      Pandas Banking
1      Pandas Grocery
2      Pandas Telecom
3    Pandas Transport
4                 NaN
Name: Customer Name, dtype: object

In [21]:
# Convert "New Customer" into a bool
data_frame["New Customer"] = data_frame['New Customer'].astype('bool')
data_frame["New Customer"]

0    False
1     True
2    False
3     True
4    False
Name: New Customer, dtype: bool

In [22]:
# Difference between 'Starting Date' and '2020-09-01'
data_frame['Starting Date'] - pd.to_datetime('2020-09-01')

0   -2732 days
1   -1585 days
2          NaT
3    -960 days
4   -4110 days
Name: Starting Date, dtype: timedelta64[ns]

In [23]:
# Importing pandas and numpy libraries
import pandas as pd
import numpy as np

# Defining columns
column_names = ["Customer ID", "Customer Name", "2018 Revenue", "2019 Revenue", "Growth", "Start Year", "Start Month", "Start Day", "New Customer"]

# Defining lists
row1 = list([1001.0, 'Pandas Banking', '235000', '248000', '5.5', 2013,3,10, 0])
row2 = list([1002.0, 'Pandas Grocery', '196000', '205000', '4.5', 2016,4,30, 0])
row3 = list([1003.0, 'Pandas Telecom', '167000', '193000', '15.5', 2010,11,24, 0])
row4 = list([1004.0, 'Pandas Transport', '79000', '90000', '13.9', 2018,1,15, 1])
row5 = list([1005.0, 'Pandas Insurance', '241000', '264000', '9.5', 2009,6,1, 0])

# Defining a DataFrame
data_frame = pd.DataFrame(data=[row1, row2, row3, row4, row5], columns=column_names)

# Display DataFrame values
data_frame

,Customer ID,Customer Name,2018 Revenue,2019 Revenue,Growth,Start Year,Start Month,Start Day,New Customer
0,1001.0,Pandas Banking,235000,248000,5.5,2013,3,10,0
1,1002.0,Pandas Grocery,196000,205000,4.5,2016,4,30,0
2,1003.0,Pandas Telecom,167000,193000,15.5,2010,11,24,0
3,1004.0,Pandas Transport,79000,90000,13.9,2018,1,15,1
4,1005.0,Pandas Insurance,241000,264000,9.5,2009,6,1,0

In [24]:
# Display DataFrame dtypes
data_frame.dtypes

Customer ID      float64
Customer Name     object
2018 Revenue      object
2019 Revenue      object
Growth            object
Start Year         int64
Start Month        int64
Start Day          int64
New Customer       int64
dtype: object

In [25]:
# select_dtypes() object
data_frame.select_dtypes('object')

      Customer Name 2018 Revenue 2019 Revenue Growth
0    Pandas Banking       235000       248000    5.5
1    Pandas Grocery       196000       205000    4.5
2    Pandas Telecom       167000       193000   15.5
3  Pandas Transport        79000        90000   13.9
4  Pandas Insurance       241000       264000    9.5

In [26]:
# select_dtypes() object and number but excluding int64
data_frame.select_dtypes(['number','object'], exclude='int64')

   Customer ID     Customer Name 2018 Revenue 2019 Revenue Growth
0       1001.0    Pandas Banking       235000       248000    5.5
1       1002.0    Pandas Grocery       196000       205000    4.5
2       1003.0    Pandas Telecom       167000       193000   15.5
3       1004.0  Pandas Transport        79000        90000   13.9
4       1005.0  Pandas Insurance       241000       264000    9.5

In [6]:
s = pd.Series(['pandas is awesome'])
s

0    pandas is awesome
dtype: object

In [10]:
s.str.split()

0    [pandas, is, awesome]
dtype: object

In [11]:
s.str.replace('pandas', 'python')

0    python is awesome
dtype: object

In [12]:
s.str.count('a')

0    3
dtype: int64

In [13]:
s.str.len()

0    17
dtype: int64

In [15]:
s.str.capitalize()

0    Pandas is awesome
dtype: object

In [16]:
s.str.islower()

0    True
dtype: bool

In [80]:
s = pd.Categorical(["large", "small", "medium", "small"], categories=["large", "small", "medium"],ordered=False)
s

[large, small, medium, small]
Categories (3, object): [large, small, medium]

In [81]:
s.categories

Index(['large', 'small', 'medium'], dtype='object')

In [82]:
s.add_categories(['extra large'])

[large, small, medium, small]
Categories (4, object): [large, small, medium, extra large]

In [83]:
s = s.reorder_categories(["small", "medium","large"], ordered=True)
s

[large, small, medium, small]
Categories (3, object): [small < medium < large]

In [84]:
s.sort_values()

[small, small, medium, large]
Categories (3, object): [small < medium < large]

In [100]:
s = pd.to_datetime(pd.Series(['1990-05-31 10:00', '1995-06-05 15:00', '2020-09-09 12:00']))
s

0   1990-05-31 10:00:00
1   1995-06-05 15:00:00
2   2020-09-09 12:00:00
dtype: datetime64[ns]

In [104]:
s.dt.date

0    1990-05-31
1    1995-06-05
2    2020-09-09
dtype: object

In [105]:
s.dt.time

0    10:00:00
1    15:00:00
2    12:00:00
dtype: object

In [101]:
s.dt.year

0    1990
1    1995
2    2020
dtype: int64

In [102]:
s.dt.day_name()

0     Thursday
1       Monday
2    Wednesday
dtype: object

In [111]:
s = pd.to_datetime(pd.Series(['1990-05-31', '1995-06-05', '2020-09-09'])) - pd.to_datetime('2020-01-01')
s

0   -10807 days
1    -8976 days
2      252 days
dtype: timedelta64[ns]

In [114]:
s.dt.total_seconds()

0   -933724800.0
1   -775526400.0
2     21772800.0
dtype: float64

In [115]:
s.dt.to_pytimedelta()

array([datetime.timedelta(days=-10807), datetime.timedelta(days=-8976),
       datetime.timedelta(days=252)], dtype=object)

In [117]:
s.dt.components

    days  hours  minutes  seconds  milliseconds  microseconds  nanoseconds
0 -10807      0        0        0             0             0            0
1  -8976      0        0        0             0             0            0
2    252      0        0        0             0             0            0